surfacesAreEquivalent(Surface!System.Runtime.CompilerServices.IsConst*,Surface!System.Runtime.CompilerServices.IsConst*,Trf!System.Runtime.CompilerServices.IsConst*,TessEpsCntrl!System.Runtime.CompilerServices.IsConst*)
Determine if two surfaces are parametrically equivalent, meaning that either they are
identical or they are parametrically coincident (i.e., pSurface1(uv) == pSurface2(uv)
for all uv). This function uses surfacesAreCoincident, and therefore is similarly
limited in the types of surfaces is handles correctly.
The optional input arguments pS1ToS2Trf and pTessEpsCntrl have the same meaning as
for surfacesAreCoincident.